cf/acc/1.2.2.56/Catalogs/Правила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Правила</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дополнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дополнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаРеализованаДополнением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяПроверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолуавтоматическаяПроверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяПриПроверке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмененоПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбслуживаемыеТипы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбнаруживаемыеОшибки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбнаруживаемыеОшибки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/acc/1.2.2.56/Catalogs/Требования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Требования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмВалидации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньИсполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорияТребований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСтандарт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправляемоеПриложение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбычноеПриложение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименяетсяДля1ССовместимо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыТребований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеализацияТребования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеHTML</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроверяемыеОшибки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбнаруживаемыеОшибки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЭтапыПроверки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/acc/1.2.2.56/Catalogs/Правила/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСеанса.СписокСсылокПравила = СформироватьСписокСсылокПравила();
	
	ОбновитьСоставТребованийПриЗаписиПравила();
	
	Если ЭтоНовый() Тогда
		УстановитьКодПравила();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСоставТребованийПриЗаписиПравила()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТребованияРеализацияТребования.Ссылка КАК СсылкаНаТребование
	|ИЗ
	|	Справочник.Требования.РеализацияТребования КАК ТребованияРеализацияТребования
	|ГДЕ
	|	ТребованияРеализацияТребования.ПравилоПроверки = &ПравилоПроверки";
	
	Запрос.УстановитьПараметр("ПравилоПроверки", Ссылка);
	МассивТребований = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СсылкаНаТребование");
	Если МассивТребований.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИсходныйМассивОшибок = Ссылка.ОбнаруживаемыеОшибки.ВыгрузитьКолонку("Ошибка");
	ТекущийМассивОшибок = ОбнаруживаемыеОшибки.ВыгрузитьКолонку("Ошибка");
	
	ОбновитьСоставТребованийККонфигурации(МассивТребований, ИсходныйМассивОшибок, ТекущийМассивОшибок);
	
КонецПроцедуры

Процедура УстановитьКодПравила()
	
	Префикс = НСтр("ru='Внеш_'");
	
	ПоследнийНомер = ПолучитьПоследнийНомерПравила(Префикс);
	НовыйНомер = ПоследнийНомер + 1;
	
	КоличествоНулей = Метаданные.Справочники.Правила.ДлинаКода - СтрДлина(Префикс);
	
	Код = Префикс + Формат(НовыйНомер, СтрШаблон("ЧЦ=%1; ЧВН=; ЧГ=0", КоличествоНулей));
	
КонецПроцедуры

Функция ПолучитьПоследнийНомерПравила(Префикс)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Правила.Код КАК Код
	|ИЗ
	|	Справочник.Правила КАК Правила
	|ГДЕ
	|	Правила.Код ПОДОБНО &Код
	|УПОРЯДОЧИТЬ ПО
	|	Код УБЫВ";
	
	Запрос.УстановитьПараметр("Код", Префикс + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПоследнийНомер = 0;
	
	Если Выборка.Следующий() Тогда
		ПоследнийНомер = СтрЗаменить(Выборка.Код, Префикс, "");
	КонецЕсли;
	
	Попытка
		ПоследнийНомер = Число(ПоследнийНомер);
	Исключение
		ПоследнийНомер = 0;
	КонецПопытки;
	
	Возврат ПоследнийНомер;
	
КонецФункции

#КонецОбласти

#КонецЕсли
